dict = {
'あ':'a', 'い':'i', 'う':'u', 'え':'e', 'お':'o',
'か':'a', 'き':'i', 'く':'u', 'け':'e', 'こ':'o',
'が':'a', 'ぎ':'i', 'ぐ':'u', 'げ':'e', 'ご':'o',
'さ':'a', 'し':'i', 'す':'u', 'せ':'e', 'そ':'o',
'ざ':'a', 'じ':'i', 'ず':'u', 'ぜ':'e', 'ぞ':'o',
'た':'a', 'ち':'i', 'つ':'u', 'て':'e', 'と':'o',
'だ':'a', 'ぢ':'i', 'づ':'u', 'で':'e', 'ど':'o',
'な':'a', 'に':'i', 'ぬ':'u', 'ね':'e', 'の':'o',
'は':'a', 'ひ':'i', 'ふ':'u', 'へ':'e', 'ほ':'o',
'ば':'a', 'び':'i', 'ぶ':'u', 'べ':'e', 'ぼ':'o',
'ぱ':'a', 'ぴ':'i', 'ぷ':'u', 'ぺ':'e', 'ぽ':'o',
'ま':'a', 'み':'i', 'む':'u', 'め':'e', 'も':'o',
'や':'a', 'ゆ':'u', 'よ':'o',
'ら':'a', 'り':'i', 'る':'u', 'れ':'e', 'ろ':'o',
'わ':'a',
'きゃ':'a', 'ぎゃ':'a', 'しゃ':'a', 'じゃ':'a',
'ちゃ':'a', 'にゃ':'a', 'ひゃ':'a', 'びゃ':'a',
'ぴゃ':'a', 'みゃ':'a', 'りゃ':'a', 
'うぃ':'i', 'すぃ':'i', 'ずぃ':'i', 'つぃ':'i',
'てぃ':'i', 'でぃ':'i', 'ふぃ':'i',
'とぅ' :'u', 'どぅ':'u',
'きゅ':'u', 'ぎゅ':'u', 'しゅ':'u', 'じゅ':'u',
'ちゅ':'u', 'てゅ':'u', 'でゅ':'u', 'にゅ':'u',
'ひゅ':'u', 'びゅ':'u', 'ぴゅ':'u', 'みゅ':'u',
'りゅ':'u', 
'いぇ':'e', 'うぇ':'e', 'きぇ':'e', 'ぎぇ':'e', 
'しぇ':'e', 'じぇ':'e', 'ちぇ':'e', 'つぇ':'e',
'にぇ':'e', 'ひぇ':'e', 'びぇ':'e', 'ぴぇ':'e',
'ふぇ':'e', 'みぇ':'e', 'りぇ':'e', 
'うぉ':'o', 'つぉ':'o', 'ふぉ':'o', 'きょ':'o',
'ぎょ':'o', 'しょ':'o', 'じょ':'o', 'ちょ':'o',
'にょ':'o', 'ひょ':'o', 'びょ':'o', 'ぴょ':'o',
'みょ':'o', 'りょ':'o', 
'を':'o', 'ん':'n'
}

def JPVCVConverter(LyricForEachSyllable):
	vowels= [dict[lyric] for lyric in  LyricForEachSyllable]
	ret=[]
	for i in range(len(LyricForEachSyllable)):
		v='-'
		if i>0:
			v= vowels[i-1]
		ret+=[(v+' '+LyricForEachSyllable[i], 1.0, True)]
	return ret


